20260311T000844--kdoc-554-『effective-javascript』__draft_book.org
:properties:
:ID: 20260311T000844
:end:
#+title:      KDOC 554: 『Effective JavaScript』
#+date:       [2026-03-11 Wed 00:08]
#+filetags:   :draft:book:
#+identifier: 20260311T000844

#+begin_comment
(kd/denote-kdoc-rename)
(kd/denote-format)

====ポリシー。
1ファイル1アイデア。
1ファイルで内容を完結させる。
常にほかのエントリとリンクする。
自分の言葉を使う。
参考文献を残しておく。
文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
ツェッテルカステンの議論に寄与するか。それで本を書けと言われて書けるか
頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。
個人の感想・意思表明ではない。事実や書籍情報に基づいている

====永久保存メモのルール。
自分の言葉で書く。
後から読み返して理解できる。
他のメモと関連付ける。
ひとつのメモにひとつのことだけを書く。
メモの内容は1枚で完結させる。
論文の中に組み込み、公表できるレベルである。

====水準を満たす価値があるか。
その情報がどういった文脈で使えるか。
どの程度重要な情報か。
そのページのどこが本当に必要な部分なのか。
公表できるレベルの洞察を得られるか

====フロー。
1. 「走り書きメモ」「文献メモ」を書く
2. 1日1回既存のメモを見て、自分自身の研究、思考、興味にどのように関係してくるかを見る
3. 追加すべきものだけ追加する

#+end_comment

* この文書のステータス
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# チェックリスト ================
# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 本文(見出しも設定する)

なし。

* メモ

- すでに複数の異なるプログラミング言語を書き慣れている人にとっては新しい言語に取り組むさい、その言語特有の注意事項から学び始めるのは効果的である。それによって言語に対するメンタルモデルを鍛え上げるとともに言語の特徴を把握できる(まえがき)
- TwoslashはTypeScriptのマークアップフォーマット
- ~type Shape = Square | Rectangle~ の Rectangle は型だが、 ~shape instanceof Rectangle~ は値で、この場合はコンストラクタ関数を指す。型空間のシンボルと値空間のシンボルがある(p15)
  - よくわからない
- 型エラーのあるコードからも出力が生成される。ほかの言語と異なるところ(p15)
- 型演算は実行時の値に影響しない(p16)
- 実行時の型は「宣言された型」と異なる可能性がある(p17)
  - TypeScriptの型なので、実行時には削除される
- TypeScriptで実行時の型が宣言した型と一致しないと、混乱する。「不健全な型」という(p17)
- C++のような言語の同じ名前でシグネチャが異なる関数が定義できる機能をオーバーロードという。TypeScriptではできない(p18)
- 1つの関数には複数の型シグネチャを指定できるが、実装は1つでなければならない。関数のオーバーロード機能は完全に型レベルで存在する(p18)
  - どういったケースで使えるのだろう
- 型は実行時に利用できない。実行時に型をチェックするには型を再構築するなんらかの方法が必要で、一般的にタグ付きユニオンやプロパティのチェックなどの方法がある(p19)
- 関数を書くとき宣言したプロパティを持ち、それ以外のプロパティは持たない引数で呼び出すことを想定してしまいがちである。これは「閉じた型」「シールされた型」と呼ばれ、TypeScriptの型システムでは表現できない。TypeScriptの型は「オープン」である(p21)
- Object.keys()が ~string[]~ で返ってくるのは「開いた型」であるから。オブジェクトのキーの一覧には、型宣言に明示的に列挙されていないフィールドが入っていることもありうるから、文字列で返る(p21)
- JavaScriptがダックタイピングを奨励しているから、TypeScriptはこれをモデリングするため構造的型付けを用いる(p24)
- エディタなどでTypeScriptがそれぞれの時点で変数の型をどのように捉えているかを見ることは、型の拡大と絞り込みに関する直感を養ううえで重要である。条件分岐のなかで変数の型が変化するのを確認することは型システムへの信頼を築くのにきわめて有効である(p30)
- JavaScriptでは歴史的経緯から ~typeof null~ は ~object"~ である(p32)

#+begin_src js
  console.log(typeof null)
#+end_src

#+RESULTS:
#+begin_src
object
undefined
#+end_src

- コードが実行される前にTypeScriptがエラーをチェックしているときには変数は型を持っているだけ。ありえる値の集合と考えられ、この集合は型のドメインと呼ぶ。number型はすべての数値の値の集合と考えられる。通常互換的に語られる「型」と「値の集合」は区別できる(p35)
  - never型は空集合。型階層の1番下に位置することから「ボトム型」と呼ばれることもある
  - 次に小さいのは単一の値を含む集合である。リテラル型が該当する
  - 2つまたは3つの値を持つ型はリテラル型のユニオンとして作れる
- 型チェッカーが行っていることの多くは、ある集合が別の集合の部分集合であるかをテストすること(p36)

#+begin_src js
  interface Identified {
    id: string;
  }
#+end_src

- ↑このインターフェースは、その型のドメインに含まれる値を説明している。どちらも満たすならそれはIdentified:
  - 値はオブジェクトか
  - stringに代入可能なidプロパティを持つか
- 型を値の集合として考えると、型に対する演算を理解しやすくなる(p37)
- 型演算は値の集合(型のドメイン)に適用されるのであって、インターフェースのプロパティに適用されるのではない(p37)
  - ~&~ のインターセクションは、プロパティではなく集合への交点である
- ~extends~ は通常、interfaceにフィールドを追加するために使われるが、元の型の値の部分集合になっていればどんな使い方もできる(p38)
  - 元の型のフィールドは ~number | null~ なのを ~number~ に上書きするなど
- 「サブタイプ」とは、ある型のドメインが他の型のドメインの部分集合であることを表現するための別の言い方である(p39)
- TypeScriptは型の等価性をほとんどチェックしない。そのため型のテストを書くのが難しい(p42)
- ~never~ (空の型)の対極にあるのは ~unknown~ である。この型のドメインにはJavaScriptのすべての値が含まれ、すべての型は ~unknown~ に代入可能である。型階層の最上位に位置するためトップ型と呼ばれる(p42)

* 関連
# 関連するエントリ。書いているファイルから見て、なぜ関連させたか書く。意味のあるつながりを意識的につくる。
# [引用、整合性、どう説明できるか、矛盾、補っているか、以前聞いたこと、対立、修正、補足、付け加え、組み合わせ、疑問]
# また、現在はリンクが見つからなくてもこういった切り口で将来関連させられそうな項目を書いておく
# [類推、未解決、具体例、追加調査、理由、動機、検証]
# 横に類推するか、上に抽象化するか、下に具体化するか

なし。
